Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/FastLED_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: **You must call `FastLED.show()`** to actually update the physical LEDs
it_it: **Si deve chiamare `FastLED.show()`** per aggiornare effettivamente i LED fisici

source: **You'll Find**:
it_it: **Cosa si Troverà**:

source: **You'll Learn**:
it_it: **Si imparerà**:

source: **[Breathing Effect](breathing.md)** - Smooth pulsing/breathing animations
it_it: **[Effetto Respiro](breathing)** - Animazioni fluide di pulsazioni/respiri

source: **[Fire Effect](fire.md)** - Realistic fire simulation using heat arrays and color palettes
it_it: **[Effetto Fuoco](fire)** - Simulazione realistica del fuoco utilizzando array di calore e palette di colori

source: **[Twinkle/Sparkle](twinkle.md)** - Random twinkling stars and sparkle effects
it_it: **[Twinkle/Sparkle](twinkle)** - Effetti scintillanti casuali con stelle e scintillìo

source: **[Wave Patterns](waves.md)** - Various wave effects including sine waves, color waves, and ocean-inspired patterns
it_it: **[Pattern ad Onda](waves)** - Vari effetti onda, tra cui onde sinusoidali, onde colorate e motivi ispirati all'oceano

source: **beatsin8()**: Generates smooth sine wave values (0-255)
it_it: **beatsin8()**: Genera valori di onda sinusoidale fluida (0-255)

source: **bpm** (beats per minute): Controls breathing speed
it_it: **bpm** (beats per minute): Controlla la velocità respiratoria

source: **brightness**: Overall brightness multiplier
it_it: **brightness**: Moltiplicatore di luminosità generale

source: **i * multiplier**: Spreads wave across strip (higher = more waves)
it_it: **i * moltiplicatore**: Distribuisce l'onda sulla striscia (più alto = più onde)

source: **index**: Position in palette (0-255, wraps around)
it_it: **index**: Posizione nella palette (0-255, si riavvolge)

source: **min/max**: Brightness range
it_it: **min/max**: Intervallo di luminosità

source: **palette**: Your CRGBPalette16 object
it_it: **palette**: Oggetto CRGBPalette16

source: **phase increment**: Controls speed (higher = faster movement)
it_it: **incremento di fase**: Controlla la velocità (più alto = più veloce movimento)

source: **phase**: Current position in animation (increment for movement)
it_it: **phase**: Posizione corrente nell'animazione (incremento per il movimento)

source: **phase_offset**: Staggers timing across LEDs
it_it: **phase_offset**: Sfalsa la temporizzazione tra i LED

source: **sin8()**: 8-bit sine function (fast and efficient)
it_it: **sin8()**: Funzione seno a 8 bit (veloce ed efficiente)

source: **⚠️ EXPERIMENTAL**: This documentation covers experimental audio features currently in development.
it_it: **⚠️ SPERIMENTALE**: Questa documentazione riguarda le funzionalità audio sperimentali attualmente in fase di sviluppo.

source: - First item description - If you want to span multiple lines, indent subsequent
it_it: - Descrizione del primo elemento - Per estendere l'elenco su più righe, rientrare le

source: - If you want to include multiple paragraphs and/or code blocks under a
it_it: - Per includere più paragrafi e/o blocchi di codice sotto una

source: - level 2 item 1: text
it_it: - livello 2 elemento 1: testo

source: - level 2 item 2: text
it_it: - livello 2 elemento 2: testo

source: 0 = all LEDs breathe together
it_it: 0 = tutti i LED respirano contemporaneamente

source: 0: Red
it_it: 0: Rosso

source: 1 at least blank line above all lower-level section headings.
it_it: almeno 1 riga vuota sopra tutte le intestazioni di sezione di livello inferiore.

source: 1-3 for subtle effect
it_it: 1-3 per un effetto delicato

source: 1. Find the Bad LED
it_it: 1. Trovare il LED Difettoso

source: 1. Insufficient Power Supply Capacity
it_it: 1. Capacità di Alimentazione Insufficiente

source: 12-15 = normal breathing pace
it_it: 12-15 = ritmo respiratorio normale

source: 128: Cyan
it_it: 128: Ciano

source: 15-30 LEDs
it_it: 15-30 LED

source: 16-bit precision oscillation:
it_it: Oscillazione di precisione a 16 bit:

source: 16-bit random numbers:
it_it: Numeri casuali a 16 bit:

source: 16-bit sine for higher precision:
it_it: seno a 16 bit per una maggiore precisione:

source: 16-bit version (0-65535):
it_it: Versione a 16 bit (0-65535):

source: 16-bit versions for larger values:
it_it: Versioni a 16 bit per valori maggiori:

source: 160: Blue
it_it: 160: Blu

source: 16x16 matrix = 768 bytes
it_it: Matrice 16x16 = 768 byte

source: 192: Purple
it_it: 192: Viola

source: 2 blank lines above "Sub Section" headings, and
it_it: 2 righe vuote sopra le intestazioni di "Sottosezione" e

source: 2. Poor Ground Connection
it_it: 2. Collegamento a Terra Scadente

source: 2. Signal Boost
it_it: 2. Aumento del Segnale

source: 20+ = rapid pulsing
it_it: 20+ = pulsazione rapida

source: 22-24 AWG acceptable for short runs (<3 feet) with few LEDs
it_it: 22-24 AWG [0.5-0.6mm] accettabile per brevi distanze (<90 cm) con pochi LED

source: 224: Pink
it_it: 224: Rosa

source: 255: Red (wraps around)
it_it: 255: Rosso (ri-avvolto)

source: 2D Noise for Movement
it_it: Rumore 2D per il Movimento

source: 2D Patterns
it_it: Pattern 2D

source: 2D/Matrix Operations
it_it: Operazioni 2D/Matriciali

source: 2D/Matrix operations
it_it: Operazioni 2D/Matriciali

source: 3 strips × 60 LEDs = 180 LEDs = 540 bytes
it_it: 3 strisce × 60 LED = 180 LED = 540 byte

source: 3. Electrical Interference
it_it: 3. Interferenze Elettriche

source: 3. Power Injection
it_it: 3. Iniezione di Potenza

source: 30-60 FPS: Good for most applications
it_it: 30-60 FPS: Buono per la maggior parte delle applicazioni

source: 32: Orange
it_it: 32: Arancione

source: 3D Noise
it_it: Rumore 3D

source: 4. Software Timing Issues
it_it: 4. Problemi di Temporizzazione Software

source: 5 strips × 100 LEDs = 500 LEDs = 1,500 bytes
it_it: 5 strisce × 100 LED = 500 LED = 1.500 byte

source: 5-10 = slow, relaxing breathing
it_it: 5-10 = respirazione lenta e rilassante

source: 5-10 for busy starfield
it_it: 5-10 per un campo di stelle intenso

source: 5-8 LEDs
it_it: 5-8 LED

source: 60+ FPS: Excellent performance
it_it: Oltre 60 FPS: Prestazioni eccellenti

source: 64: Yellow
it_it: 64: Giallo

source: 74HCT245 or dedicated level shifter modules
it_it: 74HCT245 o moduli di traslazione di livello dedicati

source: 74HCT245 or dedicated level shifter modules work well
it_it: 74HCT245 o moduli di traslazione di livello dedicati funzionano bene

source: 80+ LEDs
it_it: Oltre 80 LED

source: 96: Green
it_it: 96: Verde

source: :cpp:func:`lv_init` (note there are no parentheses after the function name) :c:macro:`LV_USE_FLEX` :cpp:type:`lv_event_t` :cpp:enum:`lv_state_t` :cpp:enumerator:`LV_STATE_CHECKED` :cpp:struct:`lv_image_dsc_t` :cpp:union:`lv_style_value_t`
it_it: :cpp:func:`lv_init` (notare che non ci sono parentesi dopo il nome della funzione) :c:macro:`LV_USE_FLEX` :cpp:type:`lv_event_t` :cpp:enum:`lv_state_t` :cpp:enumerator:`LV_STATE_CHECKED` :cpp:struct:`lv_image_dsc_t` :cpp:union:`lv_style_value_t`

source: :maxdepth: 2 <=== Internal use and needs to always be set this way
it_it: :maxdepth: 2 <=== Uso interno e deve essere sempre impostato in questo modo

source: <10 FPS: Likely performance issue
it_it: <10 FPS: Probabile problema di prestazioni

source: <30 FPS: May appear choppy, optimize code
it_it: <30 FPS: Potrebbe apparire discontinuo, ottimizzare il codice

source: <=== Empty line -- important!
it_it: <=== Riga vuota -- importante!

source: <=== any text introducing this topic and the TOC below ..
it_it: <=== qualsiasi testo che introduca questo argomento e il Sommario sottostante ..

source: <=== blank line here is important
it_it: <=== la riga vuota qui è importante

source: <=== blank line here is important - If you want to have nested bulleted lists, indent each
it_it: <=== la riga vuota qui è importante - Per avere elenchi puntati nidificati, rientrare ogni

source: <=== blank line here is important - Last list item.
it_it: <=== la riga vuota qui è importante - Ultimo elemento di elenco.

source: ====, ****, ---- are encouraged.
it_it: ====, ****, ---- sono consigliati.

source: Configuration
it_it: Configurazione

source: Directives ∙ Admonitions
it_it: Direttive ∙ Avvertenze

source: Directives
it_it: Direttive

source: Examples
it_it: Esempi

source: Furo-theme Examples
it_it: Esempi del tema Furo

source: Glossary
it_it: Glossario

source: Interpreted Text Roles
it_it: Ruoli del Testo Interpretato

source: Introduction
it_it: Introduzione

source: Kitchen Sink Page
it_it: Pagina Riassuntiva

source: Markup Specification ∙ Substitution References
it_it: Specifiche di Markup ∙ Riferimenti di Sostituzione

source: Markup Specification ∙ Tables
it_it: Specifiche di markup ∙ Tabelle

source: Markup Specification
it_it: Specifiche di Markup

source: Quick Reference
it_it: Guida Rapida

source: Quickstart
it_it: Guida Rapida

source: Referencing
it_it: Riferimenti

source: Sphinx Themes Gallery
it_it: Galleria dei Temi Sphinx

source: unique_anchor_name may appear in places other than before a heading, but if so, custom link text (like "here" the first example above) must be provided.
it_it: unique_anchor_name può apparire anche in punti diversi da prima di un'intestazione, ma in tal caso è necessario fornire un testo personalizzato per il link (come "qui" nel primo esempio sopra).

source: unique_anchor_name must be unique throughout all .rst files under ./docs/src/.
it_it: unique_anchor_name deve essere univoco in tutti i file .rst in ./docs/src/.

source: |nbhyph| (non-breaking hyphen used in titles and official names)
it_it: |nbhyph| (trattino unificatore utilizzato nei titoli e nei nomi ufficiali)

source: |nbsp| (non-breaking space),
it_it: |nbsp| (spazio unificatore),

source: |shy| (soft hyphen), and
it_it: |shy| (trattino morbido) e

source: ~~~~ only if really needed.
it_it: ~~~~ solo se realmente necessario.

source: ======= Layouts <=== Document title, seen in documentation =======
it_it: ======= Layouts <=== Titolo del documento, visibile nella documentazione =======

source: A `CRGB` object contains three color channels:
it_it: Un oggetto `CRGB` contiene tre canali colore:

source: A classic visualization that displays audio level as a growing/shrinking bar.
it_it: Una visualizzazione classica che mostra il livello audio come una barra crescente/diminuente.

source: A dot that continuously moves in one direction:
it_it: Un punto che si muove continuamente in una direzione:

source: A list of the most commonly-used special symbols can be found in ./docs/src/include/substitutions.txt.
it_it: Un elenco dei simboli speciali più comunemente utilizzati è disponibile in ./docs/src/include/substitutions.txt.

source: A practical guide to creating LED effects with FastLED.
it_it: Una guida pratica per creare effetti LED con FastLED.

source: API pseudo-directive or end-of-file, whichever comes first.
it_it: API o con la fine del file, a seconda di quale si verifica per prima.

source: API pseudo-directives below:
it_it: API seguenti:

source: API Quick Reference
it_it: Riferimento Rapido API

source: AWG for high current or longer runs
it_it: AWG [1mm] per correnti elevate o corse più lunghe

source: Accessing Individual LEDs
it_it: Accesso ai singoli LED

source: Adaptive Frame Rate
it_it: Frame Rate Adattativo

source: Add 1000µF capacitor across power supply
it_it: Aggiungere un condensatore da 1000 µF all'alimentatore

source: Add FastLED to your `platformio.ini`:
it_it: Aggiungere FastLED al file `platformio.ini`:

source: Add a 220-470Ω resistor on the data line
it_it: Aggiungere una resistenza da 220-470Ω sulla linea dati

source: Add a capacitor across power supply terminals
it_it: Aggiungere un condensatore sui terminali dell'alimentatore

source: Add a link target (anchor) before heading or paragraph that will be linked to:
it_it: Aggiungere un link di destinazione (àncora) prima dell'intestazione o del paragrafo a cui verrà collegato:

source: Add colors together (good for light effects):
it_it: Sommare i colori (ottimo per gli effetti di luce):

source: Add easing for more natural motion:
it_it: Aggiungi un effetto di fluidità per un movimento più naturale:

source: Add interactivity with sensors or controls
it_it: Aggiungere interattività con sensori o controlli

source: Add it to ./docs/src/include/external_links.txt if not already there.
it_it: Aggiungerlo a ./docs/src/include/external_links.txt se non è già presente.

source: Add more LEDs in sections
it_it: Aggiungere altri LED in sezioni

source: Add power injection as needed
it_it: Aggiungere l'iniezione di potenza se necessario

source: Add power injection every 60-100 LEDs
it_it: Aggiungere potenza ogni 60-100 LED

source: Add resistor on data line
it_it: Aggiungere una resistenza sulla linea dati

source: Add smoothing to audio readings
it_it: Aggiungere smoothing alle letture audio

source: Add with saturation (max 255):
it_it: Addizione con saturazione (max 255):

source: Add your content using ``reStructuredText`` syntax.
it_it: Aggiungere i propri contenuti utilizzando la sintassi di ``reStructuredText``.

source: Adding LEDs
it_it: Aggiunta di LED

source: Adding/Subtracting with Saturation
it_it: Addizione/Sottrazione con Saturazione

source: Additional Components
it_it: Componenti Aggiuntivi

source: Additional Quick Fixes
it_it: Ulteriori Soluzioni Rapide

source: Additional Resources
it_it: Risorse Aggiuntive

source: Additive (RGB)
it_it: Additivo (RGB)

source: Additive Blending
it_it: Fusione Additiva

source: Adds additional animation layer
it_it: Aggiunge un ulteriore layer di animazione

source: Adjust `delay(15)` to control animation speed (lower = faster)
it_it: Regolare `delay(15)` per controllare la velocità dell'animazione (più basso = più veloce)

source: Adjust `fadeToBlackBy()` value to control trail length (20-50 works well)
it_it: Regolare il valore di `fadeToBlackBy()` per controllare la lunghezza della traccia (20-50 ms è un valore ottimale)

source: Adjust calibration thresholds
it_it: Regolare le soglie di calibrazione

source: Adjust fade speed dynamically:
it_it: Regolare la velocità della dissolvenza in modo dinamico:

source: Adjust frame rate if updates take too long
it_it: Regolare il frame rate se gli aggiornamenti richiedono troppo tempo

source: Adjust map() ranges in calibration
it_it: Regolare gli intervalli di map() nella calibrazione

source: Adjust min brightness to prevent complete darkness
it_it: Regolare la luminosità minima per evitare l'oscurità completa

source: Adjust phase increment for different speeds
it_it: Regolare l'incremento di fase per diverse velocità

source: Adjust sensitivity based on your audio source:
it_it: Regola la sensibilità in base alla sorgente audio:

source: Adjust the hue delta (4th parameter) to control rainbow tightness
it_it: Regolare il delta di tonalità (4° parametro) per controllare la compattezza dell'arcobaleno

source: Adjust threshold multiplier (currently 1.5)
it_it: Regolare il moltiplicatore di soglia (attualmente 1,5)

source: Adjust timing by changing the `delay()` values or beat rates
it_it: Regolare la temporizzazione modificando i valori di `delay()` o la frequenza dei battiti

source: Adjust your XY function accordingly.
it_it: Regolare la funzione XY di conseguenza.

source: Adjusting Brightness
it_it: Regolazione della Luminosità

source: Advanced Audio Effects
it_it: Effetti Audio Avanzati

source: Advanced Blending Techniques
it_it: Tecniche di Fusione Avanzate

source: Advanced Effects
it_it: Effetti Avanzati

source: Advanced Math Examples
it_it: Esempi di Matematica Avanzata

source: Advanced Palette Techniques
it_it: Tecniche Avanzate per la Palette

source: Advanced Techniques
it_it: Tecniche Avanzate

source: Advanced blending techniques: additive/subtractive blending, brightness scaling, and easing functions for natural motion
it_it: Tecniche di sfumatura avanzate: sfumatura additiva/sottrattiva, ridimensionamento della luminosità e funzioni di attenuazione per un movimento naturale

source: Advanced effects build on the fundamental concepts from the previous sections to create more complex and visually impressive patterns.
it_it: Gli effetti avanzati si basano sui concetti fondamentali delle sezioni precedenti per creare pattern più complessi e visivamente accattivanti.

source: Advanced rainbow techniques including mirroring, chunking, breathing effects, and dual-direction animations
it_it: Tecniche avanzate per l'arcobaleno, tra cui mirroring, chunking, effetti di respirazione e animazioni bidirezionali

source: Advanced techniques combining palettes with noise, multiple palettes, and smooth palette blending with `nblendPaletteTowardPalette()`
it_it: Tecniche avanzate che combinano palette con rumore, palette multiple e miscelazione uniforme delle palette con `nblendPaletteTowardPalette()`

source: Advanced techniques: layered noise for richer patterns, noise-controlled brightness, and noise-based movement
it_it: Tecniche avanzate: rumore a strati per pattern più ricchi, luminosità controllata dal rumore e movimento basato sul rumore

source: Advanced timing techniques including beat synchronization and time-based effects
it_it: Tecniche di temporizzazione avanzate, tra cui sincronizzazione del beat ed effetti basati sul tempo

source: Advanced: Noise-Based Movement
it_it: Avanzato: Movimento Basato sul Rumore

source: After complex pointer operations
it_it: Dopo operazioni complesse con i puntatori

source: After mastering these intermediate techniques, you'll be ready to tackle:
it_it: Dopo aver padroneggiato queste tecniche intermedie, si sarà pronti per affrontare:

source: All LEDs can display same color
it_it: Tutti i LED possono visualizzare lo stesso colore

source: All LEDs full white
it_it: Tutti i LED bianchi

source: All LEDs functional
it_it: Tutti i LED funzionanti

source: All complaints will be reviewed and investigated and will result in a response that is deemed necessary and appropriate to the circumstances.
it_it: Tutti i reclami saranno esaminati e investigati e daranno luogo a una risposta ritenuta necessaria e appropriata alle circostanze.

source: All lists (including nested lists) must be preceded and followed with at least 1 blank line for the reST parser to process it correctly.
it_it: Tutti gli elenchi (inclusi quelli nidificati) devono essere preceduti e seguiti da almeno una riga vuota affinché il parser reST li elabori correttamente.

source: All noise functions return values in the range 0-255 (for `inoise8`) or 0-65535 (for `inoise16`).
it_it: Tutte le funzioni di rumore restituiscono valori compresi tra 0 e 255 (per `inoise8`) o 0-65535 (per `inoise16`).

source: All possible permutations of these letters are supported so you do not have to remember what sequence works.
it_it: Sono supportate tutte le possibili permutazioni di queste lettere, quindi non si deve ricordare quale sequenza funziona.

source: Alternating Strips
it_it: Strisce Alternate

source: Alternative: Use first LED as level shifter (power it at 3.3V)
it_it: Alternativa: utilizzare il primo LED come traslazione di livello (alimentarlo a 3,3 V)

source: Always use 1000µF or larger
it_it: Utilizzare sempre 1000 µF o più grandi

source: Always use external power supply for LED strips
it_it: Utilizzare sempre un alimentatore esterno per le strisce LED

source: And many more!
it_it: E molti altri!

source: Animate objects across the matrix:
it_it: Animare oggetti nella matrice:

source: Animate the rainbow by cycling the starting hue:
it_it: Animare l'arcobaleno alternando la tonalità iniziale:

source: Animated Sine Wave
it_it: Onda Sinusoidale Animata

source: Animations
it_it: Animazioni

source: Any of these popular boards work with FastLED:
it_it: Tutte queste schede popolari funzionano con FastLED:

source: Apply the same pattern to all strips simultaneously.
it_it: Applicare lo stesso pattern a tutte le strisce contemporaneamente.

source: Applying breathing to practical use cases: meditation lights, alert indicators, ocean waves, heartbeat patterns
it_it: Applicazione della respirazione a casi d'uso pratici: luci per la meditazione, indicatori di allerta, onde dell'oceano, schemi di battito cardiaco

source: Applying wave techniques to practical patterns: color waves moving along strip, smooth scanners with sine falloff, ocean waves (Pacifica), pride effect with multiple modulated parameters
it_it: Applicazione di tecniche ondulatorie a modelli pratici: onde colorate che si muovono lungo una striscia, scanner fluidi con sinusoide "falloff", onde oceaniche (Pacifica), effetto "pride" con molteplici parametri modulati

source: Approximate Power
it_it: Consumo Energetico Approssimativo

source: Arduino (Uno, Mega, Leonardo, etc.)
it_it: Arduino (Uno, Mega, Leonardo, ecc.)

source: Arduino 5V pin
it_it: Pin Arduino 5 V

source: Arduino 5V pin can't supply enough current
it_it: Il pin 5V di Arduino non fornisce corrente sufficiente

source: Arduino 5V pin: max ~200mA (only 3-4 LEDs at full brightness)
it_it: Pin 5 V Arduino: max ~200 mA (solo 3-4 LED alla massima luminosità)

source: Arduino IDE or PlatformIO installed
it_it: Arduino IDE o PlatformIO installato

source: Arduino Mega: 8KB total RAM (max ~2000 LEDs after overhead)
it_it: Arduino Mega: 8 KB di RAM totale (max ~2000 LED dopo l'overhead)

source: Arduino Uno: 2KB total RAM (max ~500-600 LEDs after overhead)
it_it: Arduino Uno: 2 KB di RAM totale (max ~500-600 LED dopo l'overhead)

source: Arduino pin numbering can vary by board
it_it: La numerazione dei pin di Arduino può variare a seconda della board

source: Arduino: Any digital pin works
it_it: Arduino: Funziona qualsiasi pin digitale

source: Arguments that contain more than one word or non-alphanumeric characters will cause the :cpp:expr: interpreted-text to fail.
it_it: Gli argomenti che contengono più di una parola o caratteri non alfanumerici causeranno il fallimento dell'interpreted-text :cpp:expr:.

source: Array Blur Functions
it_it: Funzioni di Sfocatura per Array

source: Array Fade Functions
it_it: Funzioni di Dissolvenza per Array

source: Array Fill Functions
it_it: Funzioni di Riempimento per Array

source: Array Manipulation
it_it: Manipolazione dell'Array

source: Array Operations
it_it: Operazioni sugli Array

source: Array operations for filling, fading, and blurring LED strips
it_it: Operazioni sugli array per il riempimento, la dissolvenza e la sfocatura di strisce LED

source: Array-based control and LED mapping
it_it: Controllo basato su array e mappatura LED

source: Attribution
it_it: Attribuzione

source: Audio Reactive Patterns
it_it: Pattern reattivi all'audio

source: Audio processing can be CPU-intensive:
it_it: L'elaborazione audio può richiedere molta CPU:

source: Audio reactive patterns
it_it: Pattern reattivi audio

source: Availability
it_it: Disponibilità

source: Available Recipes
it_it: Ricette Disponibili

source: Avoid Dynamic Allocation
it_it: Evitare l'Allocazione Dinamica

source: Avoid floating-point math
it_it: Evitare Matematica in virgola mobile

source: Avoid recalculating constants and expensive operations every frame.
it_it: Evitare di ricalcolare costanti e operazioni costose a ogni frame.

source: Avoid these frequent errors:
it_it: Evitare questi errori frequenti:

source: Backup data line
it_it: Linea dati di backup

source: Backup data line (more robust)
it_it: Linea dati di backup (più robusta)

source: Backup data line for reliability
it_it: Linea dati di backup per affidabilità

source: Bad: Recalculating Every Frame
it_it: Svantaggio: Ricalcolare ogni frame

source: Balance quality vs performance for your specific needs
it_it: Bilanciare qualità e prestazioni in base alle esigenze specifiche

source: Basic Audio Setup
it_it: Configurazione Audio di Base

source: Basic Color Blending
it_it: Fusione dei Colori di Base
